superheroes/app/controllers/hero_powers_controller.rb

    def create
      hero_power = HeroPower.new(hero_power_params)

      if hero_power.save
---
INSERT INTO "hero_powers" ("strength", "power_id", "hero_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["strength", "Average"], ["power_id", 1], ["hero_id", 3], ["created_at", "2023-03-26 18:56:01.709268"], ["updated_at", "2023-03-26 18:56:01.709268"]]