superheroes/app/controllers/powers_controller.rb

    def show
        power = Power.find_by(id: params[:id])
---
SELECT "powers".* FROM "powers" WHERE "powers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def update

        power = Power.find_by(id: params[:id])

        if power
            if power.update(power_params)
---
SELECT "powers".* FROM "powers" WHERE "powers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "powers" SET "description" = ?, "updated_at" = ? WHERE "powers"."id" = ?  [["description", "This is just a random descriptioon to show that thisu"], ["updated_at", "2023-03-26 18:28:42.756513"], ["id", 2]]